{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "conv1", "class_name": "Conv2D", "config": {"name": "conv1", "trainable": true, "filters": 256, "kernel_size": [9, 9], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "filters": 256, "kernel_size": [9, 9], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "reshape_1", "class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "target_shape": [-1, 8]}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "function": ["4wIAAAAAAAAABAAAAAUAAABDAAAAczQAAAB0AGoBdABqAnwAgwF8AWQBZAKNA30CfAJkA3wCFwAb\nAHQAagN8AoMBGwB9A3wDfAAUAFMAKQThFAEAAAogICAgVGhlIG5vbi1saW5lYXIgYWN0aXZhdGlv\nbiB1c2VkIGluIENhcHN1bGUuIEl0IGRyaXZlcyB0aGUgbGVuZ3RoIG9mIGEgbGFyZ2UgdmVjdG9y\nIHRvIG5lYXIgMSBhbmQgc21hbGwgdmVjdG9yIHRvIDAKICAgIDpwYXJhbSB2ZWN0b3JzOiBzb21l\nIHZlY3RvcnMgdG8gYmUgc3F1YXNoZWQsIE4tZGltIHRlbnNvcgogICAgOnBhcmFtIGF4aXM6IHRo\nZSBheGlzIHRvIHNxdWFzaAogICAgOnJldHVybjogYSBUZW5zb3Igd2l0aCBzYW1lIHNoYXBlIGFz\nIGlucHV0IHZlY3RvcnMKICAgIFQpAdoIa2VlcGRpbXPpAQAAACkE2gFL2gNzdW3aBnNxdWFyZdoE\nc3FydCkE2gd2ZWN0b3Jz2gRheGlz2g5zX3NxdWFyZWRfbm9ybdoFc2NhbGWpAHIMAAAA+h48aXB5\ndGhvbi1pbnB1dC0xLTNiZmY4MzE4YWJmOD7aBnNxdWFzaDMAAABzBgAAAAAHFgEWAQ==\n", [-1], null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"name": "digitcaps", "class_name": "CapsuleLayer", "config": {"name": "digitcaps", "trainable": true}, "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 10], "dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "mask_1", "class_name": "Mask", "config": {"name": "mask_1", "trainable": true}, "inbound_nodes": [[["digitcaps", 0, 0, {}], ["input_2", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["mask_1", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 1024, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "units": 784, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "out_caps", "class_name": "Length", "config": {"name": "out_caps", "trainable": true}, "inbound_nodes": [[["digitcaps", 0, 0, {}]]]}, {"name": "out_recon", "class_name": "Reshape", "config": {"name": "out_recon", "trainable": true, "target_shape": [28, 28, 1]}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["out_caps", 0, 0], ["out_recon", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}